avr-rust/avrd/packs/atmega/ATmega8535.atdf
        <register caption="TWI Status Register" name="TWSR" offset="0x21" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0x23" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0x22" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_TWI_PRESACLE">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="4" name="VAL_0x01" value="0x01"/>
        <value caption="16" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0x2C" size="1" mask="0xFF"/>
        <register caption="USART Control and Status Register A" name="UCSRA" offset="0x2B" size="1">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSRB" offset="0x2A" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size Bit 2" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSRC" offset="0x40" size="1">
          <bitfield caption="Register Select" mask="0x80" name="URSEL"/>
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size Bits" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Baud Rate Register High Byte" name="UBRRH" offset="0x40" size="1">
          <bitfield caption="Register Select" mask="0x80" name="URSEL"/>
          <bitfield caption="USART Baud Rate Register bit 11" mask="0x0C" name="UBRR1"/>
          <bitfield caption="USART Baud Rate Register bits" mask="0x03" name="UBRR" lsb="8"/>
        </register>
        <register caption="USART Baud Rate Register Low Byte" name="UBRRL" offset="0x29" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x35" size="1" mask="0xFF"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x34" size="1" mask="0xFF"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x33" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x32" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x31" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
