avr-rust/avrd/packs/atmega/ATmega8535.atdf
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x08" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
        </register>
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x4F" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Force Output Compare 1A" mask="0x08" name="FOC1A"/>
          <bitfield caption="Force Output Compare 1B" mask="0x04" name="FOC1B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x4E" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x4C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1A" offset="0x4A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1B" offset="0x48" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x46" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
      <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
        <register caption="Timer/Counter Interrupt Mask register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter2 Output Compare Match Interrupt Enable" mask="0x80" name="OCIE2"/>
          <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x40" name="TOIE2"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Output Compare Flag 2" mask="0x80" name="OCF2"/>
          <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x40" name="TOV2"/>
        </register>
        <register caption="Timer/Counter2 Control Register" name="TCCR2" offset="0x45" size="1">
          <bitfield caption="Force Output Compare" mask="0x80" name="FOC2"/>
          <bitfield caption="Waveform Genration Mode" mask="0x40" name="WGM20" values="WAVEFORM_GEN_MODE"/>
          <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2"/>
          <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM21"/>
          <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
        </register>
        <register caption="Timer/Counter2" name="TCNT2" offset="0x44" size="1" mask="0xFF"/>
        <register caption="Timer/Counter2 Output Compare Register" name="OCR2" offset="0x43" size="1" mask="0xFF"/>
        <register caption="Asynchronous Status Register" name="ASSR" offset="0x42" size="1">
          <bitfield caption="Asynchronous Timer/counter2" mask="0x08" name="AS2"/>
          <bitfield caption="Timer/Counter2 Update Busy" mask="0x04" name="TCN2UB"/>
          <bitfield caption="Output Compare Register2 Update Busy" mask="0x02" name="OCR2UB"/>
          <bitfield caption="Timer/counter Control Register2 Update Busy" mask="0x01" name="TCR2UB"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
          <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSR2"/>
        </register>
      </register-group>
      <value-group caption="" name="WAVEFORM_GEN_MODE">
        <value caption="Normal" name="VAL_0x00" value="0x00"/>
        <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
        <value caption="CTC" name="VAL_0x01" value="0x01"/>
        <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_3BIT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="General Interrupt Control Register" name="GICR" offset="0x5B" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
          <bitfield caption="External Interrupt Request 1 Enable" mask="0x80" name="INT1"/>
          <bitfield caption="External Interrupt Request 2 Enable" mask="0x20" name="INT2"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
          <bitfield caption="External Interrupt Flag 2" mask="0x20" name="INTF2"/>
        </register>
